let t = 0;

function setup() {
  createCanvas(746,480);
  textFont("sans-serif");
}

function draw() {

  background(255);

  t++;

  //------------------------
  // 上の丸
  //------------------------
noStroke();

 if(t>200){
     
// 1つ目の円：中央(200)からスタートして、90まで上がって止まる
fill(130, 28, 33);
circle(120, max(90, 200 - max(t - 200)), 60);

// 2つ目の円：時間差（t-200）で中央(200)からスタートして、145まで上がって止まる
fill(18, 51, 89);
circle(185, max(145, 200 - max(0, t - 200)), 60);

// 3つ目の円：時間差（t-200）で中央(200)からスタートして、165まで上がって止まる
fill(0, 84, 145);
circle(120, max(165, 200 - max(0, t - 200)), 35);
 }
//-------------------------
  // ロゴ本体
  //------------------------

  strokeWeight(12);

  if(t>50){

    stroke(130,28,33);

    line(80,230,
         min(160,80+(t-50)*2),
         max(190,230-(t-50)));

    line(160,190,
         min(240,160+(t-50)*2),
         min(230,190+(t-50)));

    line(240,230,
         max(160,240-(t-50)*2),
         min(270,230+(t-50)));

    line(160,270,
         max(80,160-(t-50)*2),
         max(230,270-(t-50)));
  }


  //------------------------
  // 青い部分
  //------------------------

  if(t>100){

    //"S"
    stroke(18,51,89);
    strokeWeight(12);

    line(80,250,155,287);
    line(80,250,155,350);
    line(155,350,80,(350-37));
  }

  if(t>140){

    //"U"
    stroke(0,84,145);
    strokeWeight(12);

    line(170,350,170,287);
    line(170,350,240,(350-37));
    line(240,(350-37),240,250);
  }

  //------------------------
  // 中央の赤丸
  //------------------------

  if(t>160){

    strokeWeight(3);
    stroke(255,255,255);

    fill(130,28,33);

    circle(175,215,min(30,t-160));

    strokeWeight(8);
    noStroke();
  }


  //------------------------
  // キャッチコピー
  //------------------------

  if(t>410){

    fill(20,50,90);

    textSize(32);

    text("偉大なる平凡人たれ",310,90,);

  }


  //------------------------
  // 100th
  //------------------------

  if(t>300){

    fill(130,28,33);

    textSize(120);

    text("100",min(330,150+t),220);

    textSize(60);

    text("th",min(540,360+t),220);

  }


  //------------------------
  // Anniversary
  //------------------------

  if(t>320){

    textSize(42);

    text("Anniversary",330,300);

  }


  //------------------------
  // Since
  //------------------------

  if(t>350){

    textSize(28);

    text("SINCE 1928",390,340);

  }


  //------------------------
  // 学校名
  //------------------------

  if(t>380){

    textSize(32);

    text("学校法人大阪産業大学",300,400);

  }

}
