let t = 0;


function setup() {
  createCanvas(746,480);
  textFont("sans-serif");
}

function draw() {

  background(255);

  t++;
 
//------------------------
// 文字全体のスライド
//------------------------

let textX;

if (t < 120) {

  // 最初は中央付近
  textX = 180;

} else if (t < 240) {

  // 120～240フレームで右へ移動
  textX = map(t, 120, 240, 180, 330);

} else {

  // 完成位置
  textX = 330;

}

 //------------------------
// 上の丸（バウンド）
//------------------------

noStroke();

let y1 = -100;
let y2 = -100;
let y3 = -100;

// 赤い丸
if (t > 240 && t <= 270) {
  y1 = (t - 240) * 4;
} else if (t > 270 && t <= 275) {
  y1 = 120;
} else if (t > 275 && t <= 280) {
  y1 = 95;
} else if (t > 280 && t <= 285) {
  y1 = 92;
} else if (t > 285) {
  y1 = 90;
}

// 紺色の丸
if (t > 270 && t <= 300) {
  y2 = (t - 270) * 5;
} else if (t > 300 && t <= 305) {
  y2 = 160;
} else if (t > 305 && t <= 310) {
  y2 = 150;
} else if (t > 310 && t <= 315) {
  y2 = 146;
} else if (t > 315) {
  y2 = 145;
}

// 水色の丸
if (t > 300 && t <= 325) {
  y3 = (t - 300) * 7;
} else if (t > 325 && t <= 330) {
  y3 = 180;
} else if (t > 330 && t <= 335) {
  y3 = 170;
} else if (t > 335 && t <= 340) {
  y3 = 166;
} else if (t > 340) {
  y3 = 165;
}

// 描画
fill(130,28,33);
circle(120, y1, 60)

fill(18,51,89);
circle(185, y2, 60);

fill(0,84,145);
circle(120, y3, 35);
  //------------------------
  // ロゴ本体
  //------------------------

  strokeWeight(12);

  if(t>160){

    stroke(130,28,33);

    line(80,230,
         min(160,80+(t-60)*2),
         max(190,230-(t-60)));

    line(160,190,
         min(240,160+(t-60)*2),
         min(230,190+(t-60)));

    line(240,230,
         max(160,240-(t-60)*2),
         min(270,230+(t-60)));

    line(160,270,
         max(80,160-(t-60)*2),
         max(230,270-(t-60)));
  }


  //------------------------
  // 青い部分
  //------------------------

  if(t>250){

    //"S"
    stroke(18,51,89);
    strokeWeight(12);

    line(80,250,155,287);
    line(80,250,155,350);
    line(155,350,80,(350-37));
  }

  if(t>250){

    //"U"
    stroke(0,84,145);
    strokeWeight(12);

    line(170,350,170,287);
    line(170,350,240,(350-37));
    line(240,(350-37),240,250);
  }

  //------------------------
  // 中央の赤丸
  //------------------------

  if(t>120){

    strokeWeight(3);
    stroke(255,255,255);

    fill(130,28,33);

    circle(175,215,min(30,t-150));

    strokeWeight(8);
    noStroke();
  }


  //------------------------
  // キャッチコピー
  //------------------------

  if(t>60){

    fill(20,50,90);

    textSize(32);

    text("偉大なる平凡人たれ",textX-20,90);
  
  }


  //------------------------
  // 100th
  //------------------------

  if(t>60){

    fill(130,28,33);

    textSize(120);

    text("100",textX,220);

    textSize(60);

    text("th",textX+210,220);

  }


  //------------------------
  // Anniversary
  //------------------------

  if(t>60){

    textSize(42);

    text("Anniversary",textX,300);

  }


  //------------------------
  // Since
  //------------------------

  if(t>60){

    textSize(28);

    text("SINCE 1928",textX,340);

  }


  //------------------------
  // 学校名
  //------------------------

  if(t>60){

    textSize(32);

    text("学校法人大阪産業大学",textX,400);

  }

}
