let t = 0;

function setup() {
  createCanvas(746,480);
  textFont("sans-serif");
}

function draw() {

  background(255);

  t++;

  //------------------------
  // 上の丸
  //------------------------

  noStroke();

  fill(130,28,33);

  circle(120,min(90,t),60);

  fill(18,51,89);

  circle(185,min(145,max(0,t-30)),60);

  fill(0,84,145);

  circle(120,min(165,max(0,t-50)),35);


  //------------------------
  // ロゴ本体
  //------------------------

  strokeWeight(12);

  if(t>60){

    stroke(130,28,33);

    line(80,230,
         min(160,80+(t-60)*2),
         max(190,230-(t-60)));

    line(160,190,
         min(240,160+(t-60)*2),
         min(230,190+(t-60)));

    line(240,230,
         max(160,240-(t-60)*2),
         min(270,230+(t-60)));

    line(160,270,
         max(80,160-(t-60)*2),
         max(230,270-(t-60)));
  }


  //------------------------
  // 青い部分
  //------------------------

  if(t>120){

    stroke(18,51,89);
    strokeWeight(12);

    line(80,250,155,287);
    line(80,250,155,350);
    line(155,350,80,313);
  }


  if(t>150){

    stroke(0,84,145);
    strokeWeight(12);

    line(170,350,170,287);
    line(170,350,240,313);
    line(240,313,240,250);
  }


  //------------------------
  // 中央の赤丸
  //------------------------

  if(t>50){

    strokeWeight(3);
    stroke(255);

    fill(130,28,33);

    circle(175,215,min(30,t-150));
  }


  //------------------------
  // キャッチコピー
  //------------------------

  if(t>210){

    fill(20,50,90);

    textSize(32);

    text("偉大なる平凡人たれ",310,90);

  }


  //------------------------
  // 100th
  //------------------------

  if(t>230){

    fill(130,28,33);

    let a = constrain((t-230)/40,0,1);

 // 100を左下からくるようにする
 let x100 = lerp(-150,330,a);
 let y100 = lerp(520,220,a);

    textSize(120);
    text("100",x100,y100);


    // th 右上から
    let xth = lerp(850,540,a);
    let yth = lerp(-80,220,a);

    textSize(60);
    text("th",xth,yth);

  }


  //------------------------
  // Anniversary
  //------------------------

  if(t>250){

    let a = constrain((t-250)/40,0,1);

    let x = lerp(850,330,a);
    let y = lerp(-100,300,a);

    fill(130,28,33);

    textSize(42);
    text("Anniversary",x,y);

  }


  //------------------------
  // Since
  //------------------------

  if(t>270){

    let a = constrain((t-270)/40,0,1);

    let x = lerp(850,390,a);
    let y = lerp(-100,340,a);

    fill(130,28,33);

    textSize(28);
    text("SINCE 1928",x,y);

  }


  //------------------------
  // 学校名
  //------------------------

  if(t>290){

  let a = constrain((t-290)/40,0,1);

  let x = lerp(900,300,a);
 let y = lerp(-120,400,a);

    fill(130,28,33);

    textSize(32);
    text("学校法人大阪産業大学",x,y);

  }

}
