let t = 0;


function setup() {
  createCanvas(746,480);
  textFont("sans-serif");
}

function draw() {

  background(255);

  t++;

  //------------------------
// 上の丸（飛んでくる）
//------------------------
 //------------------------
// 3色の光の線
//------------------------

if(t < 40){

  let e = t / 40;

  strokeCap(ROUND);
  strokeWeight(80);

  // 赤
  stroke(130,28,33);
  line(
    lerp(-400, 850, e),
    lerp(780, -300, e),
    lerp(200, 1450, e),
    lerp(180, -900, e)
  );

  // 紺
  stroke(18,51,89);
  line(
    lerp(-330, 920, e),
    lerp(840, -240, e),
    lerp(270, 1520, e),
    lerp(240, -840, e)
  );

  // 青
  stroke(0,84,145);
  line(
    lerp(-260, 990, e),
    lerp(900, -180, e),
    lerp(340, 1590, e),
    lerp(300, -780, e)
  );

}

noStroke();

// イージング用
let e1 = min(1, t / 45);
e1 = 1 - pow(1 - e1, 3);

let e2 = min(1, max(0, t - 20) / 45);
e2 = 1 - pow(1 - e2, 3);

let e3 = min(1, max(0, t - 40) / 45);
e3 = 1 - pow(1 - e3, 3);

// 赤
fill(130,28,33);
circle(
    lerp(-150,120,e1),
    lerp(-100,90,e1),
    60
);

// 紺
fill(18,51,89);
circle(
    lerp(900,185,e2),
    lerp(-80,145,e2),
    60
);

// 青
fill(0,84,145);
circle(
    lerp(-100,120,e3),
    lerp(600,165,e3),
    35
);


  //------------------------
  // ロゴ本体
  //------------------------

  strokeWeight(12);

  if(t>60){

    stroke(130,28,33);

    line(80,230,
         min(160,80+(t-60)*2),
         max(190,230-(t-60)));

    line(160,190,
         min(240,160+(t-60)*2),
         min(230,190+(t-60)));

    line(240,230,
         max(160,240-(t-60)*2),
         min(270,230+(t-60)));

    line(160,270,
         max(80,160-(t-60)*2),
         max(230,270-(t-60)));
  }


  //------------------------
  // 青い部分
  //------------------------

  if(t>120){

    //"S"
    stroke(18,51,89);
    strokeWeight(12);

    line(80,250,155,287);
    line(80,250,155,350);
    line(155,350,80,(350-37));
  }

  if(t>150){

    //"U"
    stroke(0,84,145);
    strokeWeight(12);

    line(170,350,170,287);
    line(170,350,240,(350-37));
    line(240,(350-37),240,250);
  }

  
  //------------------------
  // 中央の赤丸
  //------------------------

  if(t>50){

    strokeWeight(3);
    stroke(255,255,255);

    fill(130,28,33);

    circle(175,215,min(30,t-150));

    strokeWeight(8);
    noStroke();
  }


  //------------------------
  // キャッチコピー
  //------------------------

 if(t>210){

  fill(20,50,90);
  textSize(32);

  let e = min(1, (t-210)/30);
  e = 1 - pow(1-e, 3);

  let y = lerp(-100, 90, e);

  text("偉大なる平凡人たれ",310,y);

}

  //------------------------
  // 100th
  //------------------------

  if(t>230){

    fill(130,28,33);

    textSize(120);

    text("100",min(330,150+t),220);

    textSize(60);

    text("th",min(540,360+t),220);

  }


  //------------------------
  // Anniversary
  //------------------------

  if(t>250){

    textSize(42);

    text("Anniversary",330,300);

  }


  //------------------------
  // Since
  //------------------------

  if(t>270){

    textSize(28);

    text("SINCE 1928",390,340);

  }


  //------------------------
  // 学校名
  //------------------------

  if(t>290){

    textSize(32);

    text("学校法人大阪産業大学",300,400);

  }

}
